---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.ForwardIterator
source: html/67f0b78e-db6f-5095-f3e6-4e489274926f.htm
---
# Autodesk.Revit.DB.ReferenceArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ReferenceArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.